Repository: TheBigLettuce/azari
Catalog: lib/l10n/app_*.arb
Languages: ru

source: ok
ru: ок

source: Refresh
ru: Обновить

source: Back
ru: Назад

# searchHint
source: Search
ru: Поиск

# goPostHint
source: Go to a post
ru: Открыть пост

# notANumber
source: '{text}' is not a number.
ru: '{text}' — не номер.

# galleryLabel
source: Gallery
ru: Галерея

# settingsLabel
source: Settings
ru: Настройки

# booruGridPageName
source: Booru grid
ru: Booru-сетка

# downloadsPageName
source: Downloads
ru: Загрузки

source: yes
ru: да

source: no
ru: нет

# imageViewPageName
source: Image view
ru: Изображение

# tagDeleteDialogTitle
source: Do you want to delete
ru: Удалить

# settingsPageName
source: Settings
ru: Настройки

# downloadDirectorySetting
source: Download directory
ru: Папка для загрузок

# selectedBooruSetting
source: Selected booru
ru: Выбранная booru

# imageDisplayQualitySetting
source: Image display quality
ru: Качество отображения изображений

# imageDisplayQualityInfo
source: Download quality is always Original.
ru: Качество загруженного изображения всегда Оригинал.

# safeModeSetting
source: Safe mode
ru: Контент фильтр

# licenseSetting
source: License
ru: Лицензия

# widthInfoPage
source: Width
ru: Ширина

# heightInfoPage
source: Height
ru: Вышина

# sourceFileInfoPage
source: Source
ru: Оригинал

# sizeInfoPage
source: Size
ru: Размер

# ratingInfoPage
source: Rating
ru: Рейтинг

# scoreInfoPage
source: Score
ru: Очки

# createdAtInfoPage
source: Created at
ru: Созданно

source: Delete
ru: Удалить

# deleteImageConfirm
source: Do you want to delete:
ru: Удалить

# emptyValue
source: Empty
ru: Пусто

source: Date modified
ru: Время модификации

# savedTagsCount
source: Saved tags
ru: Сохраненные теги

# nameTitle
source: Name
ru: Название

# directoriesHint
source: Directories
ru: Папки

# copiedClipboard
source: Copied!
ru: Скопировано!

source: Aspect ratio
ru: Коэффициент пропорциональности

source: Hide names
ru: Скрыть названия

source: Grid columns
ru: Клеток в сетке

# metricsLabel
source: Metrics
ru: Метрика

# thumbnailsCSize
source: Thumbnails cache size
ru: Размер кэша миниатюр

# purgeThumbnails
source: Purge
ru: Очистить

source: Are you sure?
ru: Точно?

# filterHint
source: Filter
ru: Фильтровать

# elementSingular
source: element
ru: элемент

# elementPlural
source: elements
ru: элемента

source: Move to
ru: Переместить в

source: Copy to
ru: Копировать в

# cantCopySameDest
source: Can't copy to the same destination
ru: Нельзя копировать в исходное место

# cantMoveSameDest
source: Can't move to the same destination
ru: Нельзя переместить в исходное место

# pickFileNotice
source: Pick a file
ru: Выбрать файл

# blacklistedFoldersPage
source: Blacklisted Folders
ru: Скрытые папки

# currentTagTitle
source: Current tag
ru: Тег

# enterNewTagTitle
source: Enter new tag
ru: Изменить тег

source: Value is empty
ru: Значение пусто

# directoryTagNone
source: none
ru: нету

# tagSavingInProgress
source: Tag saving is already in progress
ru: Сохранение тегов уже ведется

# savingTagsSaving
source: Saving
ru: Сохранение

source: Saving tags
ru: Сохранение тегов

# tagSingular
source: tag
ru: тег

# tagPlural
source: tags
ru: тегов

source: Value is null
ru: Значение нулевое

# youCanRestoreFromTrash
source: You can restore it from the trash
ru: Можно восстановить из корзины

# resultsIncomplete
source: Results are incomplete
ru: Результат неполный

# loadMoreLabel
source: Load more
ru: Загрузить больше

source: Loaded
ru: Загружено

source: Open in browser
ru: Открыть в браузере

# enterNewNameTitle
source: Enter new name
ru: Введите новое название

source: Load tags
ru: Загрузить теги

# notValidFilename
source: Not a valid filename: {filename}
ru: Название файла неправильное: {filename}

# infoHeadline
source: Info
ru: О изображении

source: Error
ru: Ошибка

# favoritesLabel
source: Favorites
ru: Фавориты

# disassembleNoPrefix
source: No prefix
ru: Нет префикса

# disassemblePrefixNotRegistred
source: Prefix not registred
ru: Префикс не найден

# disassembleNumbersAndHash
source: Filename should include numbers and hash separated by a -, with one space to the left of the -, and one to the right of -
ru: Правильное название содержит только цифры и буквы латыницы, отделенное - знаком, окруженным одним пробелом с каждой стороны

# disassembleInvalidPostNumber
source: Invalid post number
ru: Неправильный номер поста

# disassembleNoExtension
source: Filename doesn't include extension
ru: Нет расширения файла

# disassembleHashIsInvalid
source: Hash is invalid
ru: Неправильный хэш

# disassembleExtensionTooLong
source: Extension is too long
ru: Расширение слишком длинное

# disassembleHashIsnt32
source: Hash is not 32 characters
ru: Длинна хэша не 32 знака

# disassembleExtensionInvalid
source: Extension is invalid
ru: Расширение неправильное

# directoriesPlural
source: directories
ru: папок

source: Choose
ru: Выбрать

source: Later
ru: Потом

# needChooseDirectory
source: You need to choose a download directory. Without it downloads will fail without error.
ru: Можно выбрать папку для загрузок, иначе загрузки провалятся без ошибки.

# beforeYouContinueTitle
source: Before you continue...
ru: Прежде чем продолжить...

source: Deleted from favorites
ru: Удаленно из фаворитов

# undoLabel
source: Undo
ru: Отменить

source: Ungrouped
ru: Без группы

source: More
ru: Больше

# newsTab
source: News
ru: Новости

# animePage
source: Anime
ru: Аниме

# cardWatched
source: Watched
ru: Просмотрено

source: Has translations
ru: Есть перевод

source: Tap to view
ru: Нажмите для просмотра

# translationTitle
source: Translation
ru: Перевод

# miscLabel
source: Misc
ru: Остальное

source: Pinned thumbnails size
ru: Размер кэша закрепленных миниатюр

# extendedFilesGridActions
source: Show extended files grid actions
ru: Показывать дополнительные кнопки действия для файлов

# animeAlwaysOnline
source: Always load Anime info from net
ru: Всегда загружать информацию об аниме с интернета

source: Add
ru: Добавить

source: Group
ru: Группа

source: Bookmarked
ru: Добавлено в закладки

# dashboardPage
source: Dashboard
ru: Статистика

# emptyTrashTitle
source: Are you sure you want to empty the trash?
ru: Очистить корзину?

source: This is permanent
ru: Восстановлению не подлежит

# cantCopyToTrash
source: Can't copy files to the trash. Use move.
ru: Копирование в корзину невозможно.

# unknownSegmentsPlaceholder
source: Unknown
ru: Неизвестно

# hoursShort
source: {number} hrs
ru: {number} ч.

# cardTimeSpent
source: Tile spent
ru: Время

# cardScrollerUp
source: Scrolled up
ru: Прокруток вверх

# cardTagsSaved
source: Tags saved
ru: Тегов сохранено

# cardRefreshes
source: Refreshes
ru: Обновлений

# cardDownloadTime
source: Download time
ru: Время загрузок

# cardPostsViewed
source: Posts viewed
ru: Постов просмотрено

# cardPostsDownloaded
source: Posts downloaded
ru: Постов загружено

# cardPostsSwiped
source: Posts swiped
ru: Постов свайпнуто

# cardBooruSwitches
source: Booru switches
ru: Booru переключено

# cardDirectoriesViewed
source: Directories viewed
ru: Папок просмотрено

# cardFilesSwiped
source: Files swiped
ru: Файлов свайпнуто

# cardFilesViewed
source: Files viewed
ru: Файлов просмотрено

# cardJoinedTimes
source: Joined times
ru: Соединено

# cardSameFiltered
source: Same filtered
ru: Фильтровано по схожести

# cardTrashed
source: Trashed
ru: Удаленно

# cardCopied
source: Copied
ru: Копировано

# cardMoved
source: Moved
ru: Перемещено

source: Show names
ru: Показывать названияы

source: Grid view
ru: Сетка

source: List view
ru: Лист

# cardInBrowser
source: In browser
ru: В браузере

# cardTrailer
source: Trailer
ru: Трейлер

# cardBacklog
source: Backlog
ru: Беклог

# cardInBacklog
source: In backlog
ru: В беклоге

# cardType
source: Type
ru: Тип

# cardEpisodes
source: Episodes
ru: Эпизоды

# cardAiring
source: Airing
ru: В вещании

# cardScore
source: Score
ru: Очки

# cardYear
source: Year
ru: Год

# synopsisLabel
source: Synopsis
ru: Синопсис

# charactersLabel
source: Characters
ru: Персонажи

# backgroundLabel
source: Background
ru: Предпосылка

# relationsLabel
source: Related
ru: Связанное

# backlogLabel
source: Backlog
ru: Беклог

# watchingLabel
source: Watching
ru: В просмотре

# searchAnimePage
source: Search Anime
ru: Искать аниме

# alsoKnownAs
source: Also known as: {titles}
ru: Также известно как: {titles}

source: Role
ru: Роль

# hiddenPostsPageName
source: Hidden Posts
ru: Скрытые посты

source: Try again
ru: Повторить

# animePicturesLabel
source: Pictures
ru: Изображения

# animeLoadPictures
source: Load pictures
ru: Загрузить изображения

# animeSimilar
source: Similar
ru: Похожее

# animeLoadSimilar
source: Load similar
ru: Загрузить похожее

# copyLabel
source: Copy
ru: Скопировать

source: Choose safe mode
ru: Выбрать контент фильтр

source: Remove from excluded
ru: Убрать из исключенных тегов

source: Add to excluded
ru: Добавить в исключенные теги

# pinTag
source: Pin
ru: Закрепить

# unpinTag
source: Unpin
ru: Открепить

source: Set as wallpaper
ru: Установть как обои

# noBooruTags
source: No tags
ru: Нет тегов

# megabytes
source: {number} MB
ru: {number} мб.

# settingsTheme
source: Theme
ru: Тема

# pinGroupLabel
source: Pin
ru: Закрепить

# showExcludedTags
source: Show excluded
ru: Показать исключенные

source: Search single post
ru: Искать одиночный пост

source: Search text is empty
ru: Текст поиска пустой

# enumPostRatingGeneral
source: General
ru: Повсеместный

# enumPostRatingSensitive
source: Sensitive
ru: Чуствительный

# enumPostRatingQuestionable
source: Questionable
ru: Сомнительный

# enumPostRatingExplicit
source: Explicit
ru: Нецензурный

# enumSafeModeNormal
source: Normal
ru: Полный

# enumSafeModeNone
source: None
ru: Выключен

# enumSafeModeRelaxed
source: Relaxed
ru: Расслабленный

# enumDisplayQualityOriginal
source: Original
ru: Оригинал

# enumDisplayQualitySample
source: Sample
ru: Образец

# enumSortringModeNone
source: None
ru: Никакой

# enumSortringModeSize
source: Size
ru: Размер

# enumFilteringModeFavorite
source: Favorite
ru: Фавориты

# enumFilteringModeOriginal
source: Original
ru: Оригинальный

# enumFilteringModeSame
source: Same
ru: Схожесть

# enumFilteringModeVideo
source: Video
ru: Видео

# enumFilteringModeDuplicate
source: Duplicate
ru: Дубликат

# enumFilteringModeTag
source: Tag
ru: Тег

# enumFilteringModeUntagged
source: Untagged
ru: Без тега

# enumFilteringModeTagReversed
source: Tag reversed
ru: Тег наоборот

# enumFilteringModeGroup
source: Group
ru: Группа

# enumFilteringModeUngrouped
source: Ungrouped
ru: Без группы

# enumFilteringModeNoFilter
source: No filter
ru: Без фильтра

# filteringLabel
source: Filtering
ru: Фильтр

# sortingModesLabel
source: Sorting modes
ru: Режим сортировки

# filteringModesLabel
source: Filtering modes
ru: Режим фильтрации

# todayLabel
source: Today
ru: Сегодня

source: No Internet
ru: Нет интернета

# layoutLabel
source: Layout
ru: Разметка

# homePage
source: Home
ru: Начальная страница

# segmentsUncategorized
source: Uncategorized
ru: Остальное

# segmentsSpecial
source: Special
ru: Специальное

# galleryDirectoriesFavorites
source: Favorites
ru: Фавориты

# galleryDirectoryTrash
source: Trash
ru: Корзина

# animeSearchSearching
source: Searching
ru: Поиск

# animeSearchGenres
source: Genres
ru: Жанры

# enumGridLayoutTypeGrid
source: Grid
ru: Сетка

# enumGridLayoutTypeList
source: List
ru: Лист

# enumGridLayoutTypeGridQuilted
source: Quilted grid
ru: Стеганая сетка

# enumGridLayoutTypeGridMasonry
source: Masonry grid
ru: Волнистая сетка

# enumThemeTypeSystemAccent
source: System Accent
ru: Система

# enumThemeTypeSecretPink
source: Secret Pink
ru: Розовая

# pixels
source: {number} px
ru: {number} п.

# kilobytes
source: {number} KB
ru: {number} кб.

# netThumbnailLoader
source: Thumbnail loader
ru: Загрузчик миниатюр

source: Loading thumbnail
ru: Загрузить миниатюру

source: Empty result
ru: Пустой результат

# chooseValidDirectory
source: Please choose a valid directory
ru: Неправильная папка

# pickDirectory
source: Pick a directory for downloads
ru: Папка для загрузок

# openWelcomePageSetting
source: Open welcome page
ru: Открыть странницу приветствия

# buddhaModeSetting
source: Buddha Mode
ru: Будда-режим

source: Deleted from watched
ru: Удаленно из просмотренного

# buddhaModeTags
source: Tags
ru: Теги

# bookmarksPageName
source: Bookmarks
ru: Закладки

# welcomePermissions
source: Permissions
ru: Разрешения

# welcomePermissionsExplanation
source: Photos and videos are needed for the gallery to work
ru: Без Фото и видео галерея не будет работать

# permissionsPhotosVideos
source: Photos and videos
ru: Фото и видео

# permissionsManageMedia
source: Manage media
ru: Управление медиафайлами

# permissionsNotifications
source: Notifications
ru: Уведомления

# permissionsMediaLocation
source: Media location
ru: Локация медиа

# welcomeNextLabel
source: Next
ru: Дальше

# welcomeWelcome
source: Welcome
ru: Приветствие

# welcomeSomeSettings
source: Some settings before you continue... 🛠️
ru: Несколько настроек прежде чем приступить... 🛠️

# welcomeFinishLabel
source: Finish
ru: Закончить

# welcomeFinishBody
source: Enjoy using Azari 🥳
ru: Приятного пользования 🥳

# welcomeDone
source: Done
ru: Это все

# welcomeInitalSettings
source: Inital settings
ru: Настройки

# welcomeInitalSettingsExplanation
source: Download directory is used for multiple purposes
ru: Папка для загрузок имеет несколько применений

# usingApi
source: Using {apiName}
ru: Используя {apiName}

source: Add tag
ru: Добавить тег

# valueTooShort
source: Value is too short
ru: Слишком коротко

# tagValidationError
source: Only characters allowed are A-Z, a-z, 0-9, _, (, ), and ' .
ru: Возможные для ввода знаки A-Z, a-z, 0-9, _, (, ), и ' .

source: Unsticky/sticky directory
ru: Открепить папку

source: Unblur directory
ru: Перестать размывать миниатюры

source: Blur
ru: Размыть

source: Unblur
ru: Перестать размывать

# lockDirectory
source: Lock directory group
ru: Закрыть группу папок

source: Require auth
ru: Закрыть

# notRequireAuth
source: Unauth
ru: Открыть

source: Open directory
ru: Открыть папку

# redownloadLabel
source: Redownload
ru: Загрузить снова

# enumDownloadStatusOnHold
source: On hold
ru: Следующее

# enumDownloadStatusFailed
source: Failed
ru: Не загруженное

# enumDownloadStatusInProgress
source: In progress
ru: Скачивается

# suggestionsLabel
source: Suggestions
ru: Предложения

# directoriesAuthMessage
source: Some directories require authentication
ru: Для некоторых папок нужна аутентификация

# authLabel
source: Auth
ru: Аутентифицировать

# changeGroupReason
source: Change group on directories
ru: Сменить группу

# hideDirectoryReason
source: Hide directory
ru: Скрыть папки

# joinDirectoriesReason
source: Join directories
ru: Соединить папки

# someFilesShownNotice
source: Some files can't be shown
ru: Некоторые файлы не могут быть отображены

# cardPicturesSeenToday
source: Pictures seen today
ru: Изображений просмотрено сегодня

# cardTimeSpentToday
source: Time spent today
ru: Время проведено сегодня

source: Extra safe mode filters
ru: Дополнительный контент фильтр

source: Blacklists {tags}.
ru: Скрывает теги {tags}.

source: Latest bookmarks
ru: Недавние закладки

source: No bookmarks
ru: Нет закладок

# minutesShort
source: {number} m
ru: {number} м.

# secondsShort
source: {number} s
ru: {number} с.

# emptyWidgetNotice
source: But why?.. 🤔
ru: Но почему?.. 🤔

# lastAdded
source: Recents
ru: Свежее

source: Dismiss
ru: Убрать

source: Has new posts
ru: Есть новые посты

source: From {booru}
ru: Из {booru}

# redownloadInProgress
source: Redownloading is already in progress
ru: Уже загружаются заново

# redownloadFetchingUrls
source: Fetching download urls
ru: Загрузка адресов файлов

# redownloadRedowloadingFiles
source: Redownloading {length} files
ru: Загружаются {length} файлов

# visitedPage
source: Visited
ru: Просмотренное

# upcomingAnime
source: Upcoming
ru: Скоро

# removeWatching
source: Remove from watching
ru: Не смотрю

# addWatching
source: Add to watching
ru: В смотрю

# removeWatched
source: Remove from watched
ru: Удалить из просмотренного

# addWatched
source: Add to watched
ru: В просмотренно

# removeBacklog
source: Remove from backlog
ru: Удалить из беклога

# addBacklog
source: Add to backlog
ru: В беклог

# popularPosts
source: Popular
ru: Популярные

# randomPosts
source: Random
ru: Случайные
